test/mock/company-tax-rates.json

{
  "taxRates": [{
    "companyCurrencyId": 1,
    "id": 113,
    "companyTaxTypeId": 20,
    "countryId": 240,
    "countryName": "United States",
    "description": "Local Tax",
    "startDate": "2015-07-01",
    "endDate": "2018-12-31",
    "taxRateValue": "9.000",
    "taxTypeCode": "Local",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{1}",
    "companyTaxRateStations": [{
      "companyStationId": 1,
      "stationCode": "ORD",
      "stationName": "Chicago O-hare",
      "companyTaxRateId": 113,
      "id": 314
    }]
  }, {
    "companyCurrencyId": 1,
    "id": 114,
    "companyTaxTypeId": 19,
    "countryId": 240,
    "countryName": "United States",
    "description": "GST Tax",
    "startDate": "2015-05-09",
    "endDate": "2015-05-16",
    "taxRateValue": "5.000",
    "taxTypeCode": "GST",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{10}",
    "companyTaxRateStations": [{
      "companyStationId": 10,
      "stationCode": "IAH",
      "stationName": "Houston",
      "companyTaxRateId": 114,
      "id": 315
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 118,
    "companyTaxTypeId": 18,
    "countryId": 84,
    "countryName": "United Kingdom",
    "description": "Vat Tax",
    "startDate": "2015-07-01",
    "endDate": "2015-07-11",
    "taxRateValue": "10.000",
    "taxTypeCode": "VAT",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{43}",
    "companyTaxRateStations": [{
      "companyStationId": 43,
      "stationCode": "LPL",
      "stationName": "Liverpool ",
      "companyTaxRateId": 118,
      "id": 319
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 119,
    "companyTaxTypeId": 18,
    "countryId": 84,
    "countryName": "United Kingdom",
    "description": "Vat Tax",
    "startDate": "2015-06-01",
    "endDate": "2015-06-05",
    "taxRateValue": "9.000",
    "taxTypeCode": "VAT",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{41}",
    "companyTaxRateStations": [{
      "companyStationId": 41,
      "stationCode": "LGW",
      "stationName": "Gatwick ",
      "companyTaxRateId": 119,
      "id": 320
    }]
  }, {
    "companyCurrencyId": 9,
    "id": 120,
    "companyTaxTypeId": 20,
    "countryId": 84,
    "countryName": "United Kingdom",
    "description": "Local Tax",
    "startDate": "2015-06-22",
    "endDate": "2015-06-29",
    "taxRateValue": "10.000",
    "taxTypeCode": "Local",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{45}",
    "companyTaxRateStations": [{
      "companyStationId": 45,
      "stationCode": "MAD",
      "stationName": "Madrid ",
      "companyTaxRateId": 120,
      "id": 321
    }]
  }, {
    "companyCurrencyId": null,
    "id": 122,
    "companyTaxTypeId": 18,
    "countryId": 240,
    "countryName": "United States",
    "description": "Vat Tax",
    "startDate": "2015-07-01",
    "endDate": "2018-12-31",
    "taxRateValue": "9.000",
    "taxTypeCode": "VAT",
    "taxRateType": "Percentage",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{1}",
    "companyTaxRateStations": [{
      "companyStationId": 1,
      "stationCode": "ORD",
      "stationName": "Chicago O-hare",
      "companyTaxRateId": 122,
      "id": 323
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 124,
    "companyTaxTypeId": 20,
    "countryId": 84,
    "countryName": "United Kingdom",
    "description": "Local Tax",
    "startDate": "2015-08-01",
    "endDate": "2015-08-08",
    "taxRateValue": "10.000",
    "taxTypeCode": "Local",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{44}",
    "companyTaxRateStations": [{
      "companyStationId": 44,
      "stationCode": "LTN",
      "stationName": "Luton ",
      "companyTaxRateId": 124,
      "id": 325
    }]
  }, {
    "companyCurrencyId": 9,
    "id": 126,
    "companyTaxTypeId": 18,
    "countryId": 240,
    "countryName": "United States",
    "description": "Vat Tax",
    "startDate": "2015-09-11",
    "endDate": "2015-10-10",
    "taxRateValue": "1.000",
    "taxTypeCode": "VAT",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{9}",
    "companyTaxRateStations": [{
      "companyStationId": 9,
      "stationCode": "MIA",
      "stationName": "Miami",
      "companyTaxRateId": 126,
      "id": 332
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 127,
    "companyTaxTypeId": 20,
    "countryId": 240,
    "countryName": "United States",
    "description": "Local Tax",
    "startDate": "2015-12-01",
    "endDate": "2016-05-31",
    "taxRateValue": "999.999",
    "taxTypeCode": "Local",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{9}",
    "companyTaxRateStations": [{
      "companyStationId": 9,
      "stationCode": "MIA",
      "stationName": "Miami",
      "companyTaxRateId": 127,
      "id": 333
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 128,
    "companyTaxTypeId": 18,
    "countryId": 75,
    "countryName": "Spain",
    "description": "Vat Tax",
    "startDate": "2016-02-01",
    "endDate": "2016-07-05",
    "taxRateValue": "999.999",
    "taxTypeCode": "VAT",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{20}",
    "companyTaxRateStations": [{
      "companyStationId": 20,
      "stationCode": "BCN",
      "stationName": "Barcelona",
      "companyTaxRateId": 128,
      "id": 334
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 129,
    "companyTaxTypeId": 18,
    "countryId": 240,
    "countryName": "United States",
    "description": "Vat Tax",
    "startDate": "2016-03-01",
    "endDate": "2016-05-31",
    "taxRateValue": "99.990",
    "taxTypeCode": "VAT",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{10}",
    "companyTaxRateStations": [{
      "companyStationId": 10,
      "stationCode": "IAH",
      "stationName": "Houston",
      "companyTaxRateId": 129,
      "id": 335
    }]
  }, {
    "companyCurrencyId": null,
    "id": 130,
    "companyTaxTypeId": 19,
    "countryId": 75,
    "countryName": "Spain",
    "description": "GST Tax",
    "startDate": "2015-11-01",
    "endDate": "2015-11-07",
    "taxRateValue": "9.000",
    "taxTypeCode": "GST",
    "taxRateType": "Percentage",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{21}",
    "companyTaxRateStations": [{
      "companyStationId": 21,
      "stationCode": "AGP",
      "stationName": "Malaga",
      "companyTaxRateId": 130,
      "id": 336
    }]
  }, {
    "companyCurrencyId": null,
    "id": 131,
    "companyTaxTypeId": 20,
    "countryId": 75,
    "countryName": "Spain",
    "description": "Local Tax",
    "startDate": "2015-11-01",
    "endDate": "2015-11-07",
    "taxRateValue": "9.000",
    "taxTypeCode": "Local",
    "taxRateType": "Percentage",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{19}",
    "companyTaxRateStations": [{
      "companyStationId": 19,
      "stationCode": "ALC",
      "stationName": "Alicante",
      "companyTaxRateId": 131,
      "id": 337
    }]
  }, {
    "companyCurrencyId": 8,
    "id": 132,
    "companyTaxTypeId": 19,
    "countryId": 240,
    "countryName": "United States",
    "description": "GST Tax",
    "startDate": "2015-12-09",
    "endDate": "2015-12-11",
    "taxRateValue": "12.000",
    "taxTypeCode": "GST",
    "taxRateType": "Amount",
    "currencyCode": null,
    "currencySymbol": null,
    "companyStationIds": "{1}",
    "companyTaxRateStations": [{
      "companyStationId": 1,
      "stationCode": "ORD",
      "stationName": "Chicago O-hare",
      "companyTaxRateId": 132,
      "id": 338
    }]
  }],
  "meta": {
    "count": 14,
    "limit": 14,
    "start": 0
  }
}
